In [25]:
import pandas as pd

In [26]:
df = pd.read_excel('apartment_00.xlsx')

In [27]:
df.head()

,Unnamed: 0,0,1,2,3
0,title,"['3 BHK Apartment', 'Apartment4 BHK ', 'BHK Ap...","['1 BHK Apartment', 'Apartment1 BHK ', 'BHK Ap...","['2 BHK Apartment', 'Apartment1 BHK ', 'BHK Ap...","['2 BHK Apartment', 'Apartment2 BHK ', 'BHK Ap..."
1,price,"['2.5', '2.25', '11,000', '14,000', '16,000', ...","['5,500', '8,000', '19,000', '7,000', '11,000'...","['12,000', '11,000', '9,000', '10,000', '5,500...","['20,000', '7,500', '13,500', '5,500', '5,600'..."
2,area,"['2000 ', '3150 ', '1100 ', '1200 ', '1500 ', ...","['625 ', '600 ', '1815 ', '1030 ', '1187 ', '9...","['1200 ', '1000 ', '950 ', '870 ', '950 ', '52...","['1500 ', '900 ', '1200 ', '950 ', '600 ', '86..."
3,owner_name,"['Brickhouse Realty Solutions', 'HR Associates...","['G kumawat', 'shubh', 'Total Realty Solutions...","['VIVEK', 'navya associat', 'MATOSHREE REALTY'...","['Virendra Property Consultant', 'Shiwanshu', ..."
4,address,"['Chanakyapuri', 'Chanakyapuri', 'Lokmanya Nag...","['Bhicholi Mardana', 'Scheme Number 136', 'Mah...","['Vijay Nagar', 'Mahalaxmi Nagar Colony', 'Vig...","['Vijay Nagar', 'Manawata Nagar', 'Navlakha', ..."

In [28]:
df.columns

Index(['Unnamed: 0', 0, 1, 2, 3], dtype='object')

In [29]:
df = df.transpose()

In [30]:
df.head()

,0,1,2,3,4
Unnamed: 0,title,price,area,owner_name,address
0,"['3 BHK Apartment', 'Apartment4 BHK ', 'BHK Ap...","['2.5', '2.25', '11,000', '14,000', '16,000', ...","['2000 ', '3150 ', '1100 ', '1200 ', '1500 ', ...","['Brickhouse Realty Solutions', 'HR Associates...","['Chanakyapuri', 'Chanakyapuri', 'Lokmanya Nag..."
1,"['1 BHK Apartment', 'Apartment1 BHK ', 'BHK Ap...","['5,500', '8,000', '19,000', '7,000', '11,000'...","['625 ', '600 ', '1815 ', '1030 ', '1187 ', '9...","['G kumawat', 'shubh', 'Total Realty Solutions...","['Bhicholi Mardana', 'Scheme Number 136', 'Mah..."
2,"['2 BHK Apartment', 'Apartment1 BHK ', 'BHK Ap...","['12,000', '11,000', '9,000', '10,000', '5,500...","['1200 ', '1000 ', '950 ', '870 ', '950 ', '52...","['VIVEK', 'navya associat', 'MATOSHREE REALTY'...","['Vijay Nagar', 'Mahalaxmi Nagar Colony', 'Vig..."
3,"['2 BHK Apartment', 'Apartment2 BHK ', 'BHK Ap...","['20,000', '7,500', '13,500', '5,500', '5,600'...","['1500 ', '900 ', '1200 ', '950 ', '600 ', '86...","['Virendra Property Consultant', 'Shiwanshu', ...","['Vijay Nagar', 'Manawata Nagar', 'Navlakha', ..."

In [94]:
Title, Price, Area, Owner_name, Address = [],[],[],[],[]

In [107]:
for i in range(1): 
    for j in range(5): 
        Title.append(df[i])

for i in range(1,2): 
    for j in range(5): 
        Price.append(df[j])
        

for i in range(2,3): 
    for j in range(5): 
        Area.append(df[j])

for i in range(3,4): 
    for j in range(5): 
        Owner_name.append(df[j])

for i in range(4,5): 
    for j in range(5): 
        Address.append(df[j])

In [106]:
df[0]

Unnamed: 0                                                title
0             ['3 BHK Apartment', 'Apartment4 BHK ', 'BHK Ap...
1             ['1 BHK Apartment', 'Apartment1 BHK ', 'BHK Ap...
2             ['2 BHK Apartment', 'Apartment1 BHK ', 'BHK Ap...
3             ['2 BHK Apartment', 'Apartment2 BHK ', 'BHK Ap...
Name: 0, dtype: object

In [68]:
new_df

,0,1,2,3,4
Unnamed: 0,title,price,area,owner_name,address
0,"['3 BHK Apartment', 'Apartment4 BHK ', 'BHK Ap...","['2.5', '2.25', '11,000', '14,000', '16,000', ...","['2000 ', '3150 ', '1100 ', '1200 ', '1500 ', ...","['Brickhouse Realty Solutions', 'HR Associates...","['Chanakyapuri', 'Chanakyapuri', 'Lokmanya Nag..."
1,"['1 BHK Apartment', 'Apartment1 BHK ', 'BHK Ap...","['5,500', '8,000', '19,000', '7,000', '11,000'...","['625 ', '600 ', '1815 ', '1030 ', '1187 ', '9...","['G kumawat', 'shubh', 'Total Realty Solutions...","['Bhicholi Mardana', 'Scheme Number 136', 'Mah..."
2,"['2 BHK Apartment', 'Apartment1 BHK ', 'BHK Ap...","['12,000', '11,000', '9,000', '10,000', '5,500...","['1200 ', '1000 ', '950 ', '870 ', '950 ', '52...","['VIVEK', 'navya associat', 'MATOSHREE REALTY'...","['Vijay Nagar', 'Mahalaxmi Nagar Colony', 'Vig..."
3,"['2 BHK Apartment', 'Apartment2 BHK ', 'BHK Ap...","['20,000', '7,500', '13,500', '5,500', '5,600'...","['1500 ', '900 ', '1200 ', '950 ', '600 ', '86...","['Virendra Property Consultant', 'Shiwanshu', ...","['Vijay Nagar', 'Manawata Nagar', 'Navlakha', ..."

In [70]:
new_df[0][0]

"['3 BHK Apartment', 'Apartment4 BHK ', 'BHK Apartment2 ', '2 BHK Apartment', 'Apartment2 BHK ', 'BHK Apartment2 ', '2 BHK Apartment', 'Apartment2 BHK ', 'BHK Apartment1 ', '1 BHK Apartment', 'Apartment2 BHK ', 'BHK Apartment2 ', '2 BHK Apartment', 'Apartment1 BHK ', 'BHK Apartment1 ', '1 BHK Apartment', 'Apartment2 BHK ', 'BHK Apartment2 ', '2 BHK Apartment', 'Apartment1 BHK ', 'BHK Apartment2 ', '2 BHK Apartment', 'Apartment2 BHK ', 'BHK Apartment2 ', '2 BHK Apartment', 'Apartment2 BHK ', 'BHK Apartment2 ', '2 BHK Apartment', 'Apartment3 BHK ']"

In [66]:
# new_df = pd.DataFrame(list(zip(df[0], df[1], df[2], df[3], df[4])),
#                            columns =['Title', 'Price', 'Area', 'Owner_name', 'Address'])          
new_df = pd.DataFrame()

In [36]:
df[0][0]

"['1 BHK Apartment', 'Apartment1 BHK ', 'BHK Apartment3 ', '3 BHK Apartment', 'Apartment2 BHK ', 'BHK Apartment2 ', '2 BHK Apartment', 'Apartment2 BHK ', 'BHK Apartment1 ', '1 BHK Apartment', 'Apartment1 BHK ', 'BHK Apartment1 ', '1 BHK Apartment', 'Apartment2 BHK ', 'BHK Apartment2 ', '2 BHK Apartment', 'Apartment2 BHK ', 'BHK Apartment1 ', '1 BHK Apartment', 'Apartment2 BHK ', 'BHK Apartment3 ', '3 BHK Apartment', 'Apartment2 BHK ', 'BHK Apartment1 ', '1 BHK Apartment', 'Apartment2 BHK ', 'BHK Apartment2 ', '2 BHK Apartment', 'Apartment2 BHK ']"

In [47]:
new_df

,Title,Price,Area,Owner_name,Address
0,title,price,area,owner_name,address
1,"['3 BHK Apartment', 'Apartment4 BHK ', 'BHK Ap...","['2.5', '2.25', '11,000', '14,000', '16,000', ...","['2000 ', '3150 ', '1100 ', '1200 ', '1500 ', ...","['Brickhouse Realty Solutions', 'HR Associates...","['Chanakyapuri', 'Chanakyapuri', 'Lokmanya Nag..."
2,"['1 BHK Apartment', 'Apartment1 BHK ', 'BHK Ap...","['5,500', '8,000', '19,000', '7,000', '11,000'...","['625 ', '600 ', '1815 ', '1030 ', '1187 ', '9...","['G kumawat', 'shubh', 'Total Realty Solutions...","['Bhicholi Mardana', 'Scheme Number 136', 'Mah..."
3,"['2 BHK Apartment', 'Apartment1 BHK ', 'BHK Ap...","['12,000', '11,000', '9,000', '10,000', '5,500...","['1200 ', '1000 ', '950 ', '870 ', '950 ', '52...","['VIVEK', 'navya associat', 'MATOSHREE REALTY'...","['Vijay Nagar', 'Mahalaxmi Nagar Colony', 'Vig..."
4,"['2 BHK Apartment', 'Apartment2 BHK ', 'BHK Ap...","['20,000', '7,500', '13,500', '5,500', '5,600'...","['1500 ', '900 ', '1200 ', '950 ', '600 ', '86...","['Virendra Property Consultant', 'Shiwanshu', ...","['Vijay Nagar', 'Manawata Nagar', 'Navlakha', ..."